chayuto/ESP32-C6-Touch-AMOLED-1.8/projects/16_bitchat_relay/sdkconfig.defaults.template
CONFIG_IDF_TARGET="esp32c6"

# Flash / Partition
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler — optimize for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# LVGL memory — 24KB for simple dashboard
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# LVGL color — SH8601 expects swapped bytes over QSPI
CONFIG_LV_COLOR_16_SWAP=y

# BLE — NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=9
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# No Wi-Fi — save ~55KB RAM
CONFIG_ESP_WIFI_ENABLED=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
